In [1]:
#%%HTML
#<style type="text/css">
#    table.dataframe td, table.dataframe th {
#        border-style: solid;
#    }
#</style>

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels=['a','b','c']
mydata=[10,20,30]
arr=np.array(mydata)
d={'a':10,'b':20,'c':30}

# Series

In [4]:
print(pd.Series(data=mydata))
print(pd.Series(mydata))
#case sensitive "Series" not "series"

0    10
1    20
2    30
dtype: int64
0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=mydata,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(mydata,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser3=pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [10]:
print(ser3[1])

b

In [11]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [13]:
print(ser1['USA'])

1

In [14]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

In [15]:
from numpy.random import randn

In [16]:
#np.random.seed(101)

In [17]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  1.074847  0.594859  0.612205  1.228435
B  0.647362 -0.505261 -1.365485  2.163655
C  0.087935 -0.233348  0.733634 -1.882267
D  1.235064  1.657118 -0.837677 -0.348441
E -1.156004 -1.331442  0.165568 -0.835659

In [18]:
print(df['W'])
print(df[['X','Y']])

A    1.074847
B    0.647362
C    0.087935
D    1.235064
E   -1.156004
Name: W, dtype: float64
          X         Y
A  0.594859  0.612205
B -0.505261 -1.365485
C -0.233348  0.733634
D  1.657118 -0.837677
E -1.331442  0.165568

In [19]:
df['new']=df['W']+df['X']
print(df)

          W         X         Y         Z       new
A  1.074847  0.594859  0.612205  1.228435  1.669707
B  0.647362 -0.505261 -1.365485  2.163655  0.142102
C  0.087935 -0.233348  0.733634 -1.882267 -0.145412
D  1.235064  1.657118 -0.837677 -0.348441  2.892182
E -1.156004 -1.331442  0.165568 -0.835659 -2.487446

In [20]:
df.drop('A',axis=0)

          W         X         Y         Z       new
B  0.647362 -0.505261 -1.365485  2.163655  0.142102
C  0.087935 -0.233348  0.733634 -1.882267 -0.145412
D  1.235064  1.657118 -0.837677 -0.348441  2.892182
E -1.156004 -1.331442  0.165568 -0.835659 -2.487446

In [21]:
df.drop('new',axis=1)

#These 2 cells shows how to use "axis"
#axis=0 : horizontal
#axis=1 : vertical

          W         X         Y         Z
A  1.074847  0.594859  0.612205  1.228435
B  0.647362 -0.505261 -1.365485  2.163655
C  0.087935 -0.233348  0.733634 -1.882267
D  1.235064  1.657118 -0.837677 -0.348441
E -1.156004 -1.331442  0.165568 -0.835659

In [22]:
df
# This cell shows that row 'A' and column 'new' isn't deleted.

          W         X         Y         Z       new
A  1.074847  0.594859  0.612205  1.228435  1.669707
B  0.647362 -0.505261 -1.365485  2.163655  0.142102
C  0.087935 -0.233348  0.733634 -1.882267 -0.145412
D  1.235064  1.657118 -0.837677 -0.348441  2.892182
E -1.156004 -1.331442  0.165568 -0.835659 -2.487446

In [23]:
#Show how to delete row/column with "drop" command
df.drop('new',axis=1,inplace=True)

In [24]:
df
#'new' colums is already deleted.

          W         X         Y         Z
A  1.074847  0.594859  0.612205  1.228435
B  0.647362 -0.505261 -1.365485  2.163655
C  0.087935 -0.233348  0.733634 -1.882267
D  1.235064  1.657118 -0.837677 -0.348441
E -1.156004 -1.331442  0.165568 -0.835659

In [25]:
df.shape

(5, 4)

In [26]:
df[['Z','X']]

          Z         X
A  1.228435  0.594859
B  2.163655 -0.505261
C -1.882267 -0.233348
D -0.348441  1.657118
E -0.835659 -1.331442

In [27]:
df.loc['A']

W    1.074847
X    0.594859
Y    0.612205
Z    1.228435
Name: A, dtype: float64

In [28]:
print(df['W'])

A    1.074847
B    0.647362
C    0.087935
D    1.235064
E   -1.156004
Name: W, dtype: float64

In [29]:
df

          W         X         Y         Z
A  1.074847  0.594859  0.612205  1.228435
B  0.647362 -0.505261 -1.365485  2.163655
C  0.087935 -0.233348  0.733634 -1.882267
D  1.235064  1.657118 -0.837677 -0.348441
E -1.156004 -1.331442  0.165568 -0.835659

In [30]:
#but
#print(df['C']) 
#will error
df.loc['C']

W    0.087935
X   -0.233348
Y    0.733634
Z   -1.882267
Name: C, dtype: float64

In [31]:
df.iloc[2]
# iloc is used with numerical index(0,1,2,...)

W    0.087935
X   -0.233348
Y    0.733634
Z   -1.882267
Name: C, dtype: float64

In [32]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.074847  0.612205
B  0.647362 -1.365485

# DataFrame Part2

In [33]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
D -0.125471  0.380827 -0.297029  1.027920
E  1.647117 -0.106913 -0.593343  2.892534

In [34]:
booldf=df>0
booldf

       W      X      Y      Z
A  False  False   True  False
B   True  False  False   True
C   True  False  False  False
D  False   True  False   True
E   True  False  False   True

In [35]:
df[booldf]

          W         X        Y         Z
A       NaN       NaN  0.30098       NaN
B  0.002701       NaN      NaN  0.366286
C  0.297563       NaN      NaN       NaN
D       NaN  0.380827      NaN  1.027920
E  1.647117       NaN      NaN  2.892534

In [36]:
df[df>0]
#same result

          W         X        Y         Z
A       NaN       NaN  0.30098       NaN
B  0.002701       NaN      NaN  0.366286
C  0.297563       NaN      NaN       NaN
D       NaN  0.380827      NaN  1.027920
E  1.647117       NaN      NaN  2.892534

In [37]:
df

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
D -0.125471  0.380827 -0.297029  1.027920
E  1.647117 -0.106913 -0.593343  2.892534

In [38]:
df['W']>0

A    False
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [39]:
df[df['W']>0]

          W         X         Y         Z
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
E  1.647117 -0.106913 -0.593343  2.892534

In [40]:
df[df['Z']<0]

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
C  0.297563 -1.786976 -2.436503 -0.084126

In [41]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
E  1.647117 -0.106913 -0.593343  2.892534

In [42]:
resultdf['X']

B   -0.763261
C   -1.786976
E   -0.106913
Name: X, dtype: float64

In [43]:
df

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
D -0.125471  0.380827 -0.297029  1.027920
E  1.647117 -0.106913 -0.593343  2.892534

In [44]:
df[df['W']>0]['X']

B   -0.763261
C   -1.786976
E   -0.106913
Name: X, dtype: float64

In [45]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.213881 -0.763261
C -2.436503 -1.786976
E -0.593343 -0.106913

In [46]:
df['W']>0

A    False
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [47]:
boolseries = df['W']>0
result = df[boolseries]
result

          W         X         Y         Z
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
E  1.647117 -0.106913 -0.593343  2.892534

In [48]:
boolseries = df['W']>0
result = df[boolseries]
mycols = ['Y','X']
result[mycols]

          Y         X
B -0.213881 -0.763261
C -2.436503 -1.786976
E -0.593343 -0.106913

In [49]:
df[df['W']>0][['Y','X']]
# abbreviated form of the above cell

          Y         X
B -0.213881 -0.763261
C -2.436503 -1.786976
E -0.593343 -0.106913

In [50]:
df

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
D -0.125471  0.380827 -0.297029  1.027920
E  1.647117 -0.106913 -0.593343  2.892534

In [51]:
df[(df['W']>0) & (df['Y']>0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [52]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
E  1.647117 -0.106913 -0.593343  2.892534

In [53]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.313851 -0.615454  0.300980 -0.046257
1     B  0.002701 -0.763261 -0.213881  0.366286
2     C  0.297563 -1.786976 -2.436503 -0.084126
3     D -0.125471  0.380827 -0.297029  1.027920
4     E  1.647117 -0.106913 -0.593343  2.892534

In [54]:
df

          W         X         Y         Z
A -0.313851 -0.615454  0.300980 -0.046257
B  0.002701 -0.763261 -0.213881  0.366286
C  0.297563 -1.786976 -2.436503 -0.084126
D -0.125471  0.380827 -0.297029  1.027920
E  1.647117 -0.106913 -0.593343  2.892534

In [55]:
newind = 'CA FR DF HE TY'.split()
df['States'] = newind
df

          W         X         Y         Z States
A -0.313851 -0.615454  0.300980 -0.046257     CA
B  0.002701 -0.763261 -0.213881  0.366286     FR
C  0.297563 -1.786976 -2.436503 -0.084126     DF
D -0.125471  0.380827 -0.297029  1.027920     HE
E  1.647117 -0.106913 -0.593343  2.892534     TY

In [56]:
df.set_index("States")

               W         X         Y         Z
States
CA     -0.313851 -0.615454  0.300980 -0.046257
FR      0.002701 -0.763261 -0.213881  0.366286
DF      0.297563 -1.786976 -2.436503 -0.084126
HE     -0.125471  0.380827 -0.297029  1.027920
TY      1.647117 -0.106913 -0.593343  2.892534

# DataFrames Part 3

In [57]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [58]:
print(outside)
print(inside)
print(hier_index)

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
[1, 2, 3, 1, 2, 3]
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [59]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -1.686441 -0.063293
   2  1.335694  0.606401
   3  0.027882  0.287960
G2 1  0.190675  0.401273
   2 -0.626741  0.004704
   3 -0.801502  0.178142

In [60]:
print(df.loc['G1'])

print()

print(df.loc['G1'].loc[1])

          A         B
1 -1.686441 -0.063293
2  1.335694  0.606401
3  0.027882  0.287960

A   -1.686441
B   -0.063293
Name: 1, dtype: float64

In [61]:
df.index.names=["Groups","Num"]
df

                   A         B
Groups Num
G1     1   -1.686441 -0.063293
       2    1.335694  0.606401
       3    0.027882  0.287960
G2     1    0.190675  0.401273
       2   -0.626741  0.004704
       3   -0.801502  0.178142

In [62]:
df.loc['G2'].loc[2]['B']

0.004704402251520868

In [63]:
df.loc['G1']

            A         B
Num
1   -1.686441 -0.063293
2    1.335694  0.606401
3    0.027882  0.287960

In [64]:
df.xs('G1')

            A         B
Num
1   -1.686441 -0.063293
2    1.335694  0.606401
3    0.027882  0.287960

In [65]:
df.xs(1,level='Num')

               A         B
Groups
G1     -1.686441 -0.063293
G2      0.190675  0.401273

# Missing Data

In [66]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [68]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [69]:
df.dropna(thresh=2)
#delete only rows that have more than or equal 2 NaN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [70]:
df.fillna(value='KKK')

     A    B  C
0    1    5  1
1    2  KKK  2
2  KKK  KKK  3

In [71]:
df['A']=df['A'].fillna(value=df['A'].mean())

In [72]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# Groupby

In [73]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [74]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [75]:
bycomp=df.groupby('Company')

In [76]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [77]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [78]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [79]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [80]:
#Abbreviated Form
df.groupby("Company").sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [81]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [82]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [83]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [84]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining, and Concatenating

### Example 1

In [85]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [86]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [87]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [88]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [89]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [90]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [91]:
pd.concat([df1,df2,df3],axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [92]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Example 2

In [93]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [94]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [95]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [96]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [97]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or to show a more complicated example:

In [98]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [99]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [100]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [101]:
pd.merge(left, right, on=['key1', 'key2'])
#concept: For joining these two tables, both keys of 'left' and 'right' must be same.

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [102]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [103]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [104]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

# Operations

In [105]:
import numpy as np
import pandas as pd

In [106]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [107]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [108]:
df['col2'].nunique()

3

In [109]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [110]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [111]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [112]:
def times2(x) : return x*2

In [113]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [114]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [115]:
#combine with lambda
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [116]:
df.drop('col1',axis=1,inplace=True)
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [117]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [118]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [119]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [120]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [121]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [122]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [123]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])
# no value at "foo two y" and "bar two x"

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output
* SQL
* Excel
* HTML
* SQL

In [124]:
import pandas as pd

In [125]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [126]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [127]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [128]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"